Feature: Добавяне на самолет

Scenario: Добавяне на самолет
    Given Потребителят се намира на прозореца за добавяне на самолети
    When Потребителят въведе номер на опашка на самолет "EI-DHH"
    And Потребителят въведе тип на самолета "Boeing 737 NG"
    And Потребителят въведе капацитет на екипажа 182
	And Потребителят въведе капацитет на товар 2500
    And Потребителят натиска бутона за добавяне на самолет
    Then Подскача съобщение "Самолетът е добавен успешно"
    
Scenario: Добавяне на самолет
    Given Потребителят се намира на прозореца за добавяне на самолети
    When Потребителят въведе тип на самолета "Boeing 737 NG"
    And Потребителят въведе капацитет на екипажа 182
	And Потребителят въведе капацитет на товар 2500
    And Потребителят натиска бутона за добавяне на самолет
    Then Подскача съобщение "Моля въведете номер на опашката"
    
Scenario: Добавяне на самолет
    Given Потребителят се намира на прозореца за добавяне на самолети
    When Потребителят въведе номер на опашка на самолет "EI-DHH"
    And Потребителят въведе капацитет на екипажа 182
	And Потребителят въведе капацитет на товар 2500
    And Потребителят натиска бутона за добавяне на самолет
    Then Подскача съобщение "Моля въведете тип на самолета"
    
Scenario: Добавяне на самолет
    Given Потребителят се намира на прозореца за добавяне на самолети
    When Потребителят въведе номер на опашка на самолет "EI-DHH"
    And Потребителят въведе тип на самолета "Boeing 737 NG"
	And Потребителят въведе капацитет на товар 2500
    And Потребителят натиска бутона за добавяне на самолет
    Then Подскача съобщение "Моля въведете капацитет на екипажа"
    
Scenario: Добавяне на самолет
    Given Потребителят се намира на прозореца за добавяне на самолети
    When Потребителят въведе номер на опашка на самолет "EI-DHH"
    And Потребителят въведе тип на самолета "Boeing 737 NG"
    And Потребителят въведе капацитет на екипажа 182
    And Потребителят натиска бутона за добавяне на самолет
    Then Подскача съобщение "Моля въведете капацитет на товар"